// ДЗ № 5.1
// Вивести в консоль числа від 20 до 30 через пропуск використовуючи крок 0,5 (20 20,5 21 21,5 ....)
// for (x = 20; x <= 30; x += 0.5) {
//   console.log(x);
// }
// або:
// let y = 20;
// while (y <= 30) {
//   console.log(y);
//   y += 0.5;
// }

// ДЗ № 5.2
// Один долар коштує 26 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів
// const counts = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100];
// for (let count of counts) {
//   if ((cource = 26)) {
//     console.log(cource * count);
//   }
// }

// ДЗ № 5.3
// Дано ціле число N (ввести через prompt). Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N
let n = prompt("Будь ласка введіть число");
for (x = 1; x <= 100; x++) {
  if (x * x <= n) {
    console.log(x);
  }
}
